app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
  def index
    @articles = Article.all # line added

INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?)  [["title", "a"], ["body", "aaaaaaaaaaaaa"], ["created_at", "2023-01-05 01:32:00.887794"], ["updated_at", "2023-01-05 01:32:00.887794"], ["status", "public"]]
---
  def create
    @article = Article.new(article_params)
    #@article = Article.new(title: "...", body: "...") #original way

    if @article.save